let money, 
    time;

    money = prompt("Ваш бюджет на месяц?");
    time = prompt("Введите дату в формате YYYY-MM-DD");

let appData = {
    money();
    timeData(time);
    expenses();
    optionalExpenses {

    };
    income [];
    savings(0);
};

let expenses {
   question1 = prompt("Введите обязательную статью расходов в этом месяце");
   question2 = prompt("Во сколько обойдется?");
   question3 = prompt("Введите обязательную статью расходов в этом месяце");
   question4 = prompt("Во сколько обойдется?");

};

alert("Ваш бюджет на месяц = " + question2 + question4);

//Вопросы к этому заданию

//Сколько типов данных существует в JS?
//Восемь типов данных

//Как вывести информацию в консоль?
//С помощью функции console.log();


//Какая функция операторов || и &&?
//Оператор || (или) проверяет правдиво ли одно из условий
//Оператор & (и) проверяет правдивы ли оба условия